src/cf/DataProcessors/CRM_РегистрацияОбъектовВУниверсальномЖурналеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>CRM_РегистрацияОбъектовВУниверсальномЖурналеДокументов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ЖурналДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ЖурналДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ОбъектыЖурналаДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВходящееИсходящее</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВходящееИсходящееСобытие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеИнтереса</Name>
					<Comment>Состояние интереса</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияИнтересов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьПрисоединенныеФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойИнтерес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтересЯвляетсяОснованием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписокУчастников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГлавнаяЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_ОбъектыЖурналаДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CRM_Интерес</Name>
					<Comment>Интерес</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_Интерес</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>вогТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/CRM_РегистрацияОбъектовВУниверсальномЖурналеДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ЗарегистрироватьРазрегистрироватьОбъекты(МассивОбъектов, Зарегистрировать, ПериодНачало = Неопределено, ПериодОкончание = Неопределено) Экспорт
	Если МассивОбъектов.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	Если Зарегистрировать Тогда
		ТекстЗапроса = "";
		
		Для нИндекс = 0 По МассивОбъектов.ВГраница() Цикл
			Объект = МассивОбъектов[нИндекс];
			
			ПолноеИмя = CRM_КлиентыСервер.ПолучитьПолноеИмяМетаданныхОбъектаПоСсылкеНаПВХОбъектыЖурнала(Объект);
			Если Не ЗначениеЗаполнено(ПолноеИмя) Тогда Продолжить; КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ Ссылка КАК Ссылка
			|
			|ИЗ " + ПолноеИмя + "
			|";
			
			Если ЗначениеЗаполнено(ПериодНачало) Или ЗначениеЗаполнено(ПериодОкончание) Тогда
				бЕстьДата = Ложь;
				МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
				Попытка
					ТестоваяПеременная = МетаданныеОбъекта.СтандартныеРеквизиты.Дата;
					бЕстьДата = Истина;
				Исключение КонецПопытки;
				Если Не бЕстьДата Тогда
					Попытка
						ТестоваяПеременная = МетаданныеОбъекта.Реквизиты.Дата;
						бЕстьДата = Истина;
					Исключение КонецПопытки;
				КонецЕсли;
				
				Если бЕстьДата Тогда
					Если ЗначениеЗаполнено(ПериодНачало) И ЗначениеЗаполнено(ПериодОкончание) Тогда
						ТекстЗапроса = ТекстЗапроса + "
						| ГДЕ Дата МЕЖДУ &ПериодНачало И &ПериодОкончание"
					ИначеЕсли ЗначениеЗаполнено(ПериодНачало) Тогда
						ТекстЗапроса = ТекстЗапроса + "
						| ГДЕ Дата >= &ПериодНачало"
					ИначеЕсли ЗначениеЗаполнено(ПериодОкончание) Тогда
						ТекстЗапроса = ТекстЗапроса + "
						| ГДЕ Дата <= &ПериодОкончание"
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если нИндекс <> МассивОбъектов.ВГраница() Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|"
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ Объект КАК Ссылка ИЗ РегистрСведений.CRM_ЖурналДокументов ГДЕ ТипОбъекта В (&МассивОбъектов)";
		
		Если ЗначениеЗаполнено(ПериодНачало) И ЗначениеЗаполнено(ПериодОкончание) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|И Дата МЕЖДУ &ПериодНачало И &ПериодОкончание"
		ИначеЕсли ЗначениеЗаполнено(ПериодНачало) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|И Дата >= &ПериодНачало"
		ИначеЕсли ЗначениеЗаполнено(ПериодОкончание) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|И Дата <= &ПериодОкончание"
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	ПараметрыЗапроса = Запрос.НайтиПараметры();
	Если ПараметрыЗапроса.Найти("ПериодНачало") <> Неопределено Тогда
		Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	КонецЕсли;
	Если ПараметрыЗапроса.Найти("ПериодОкончание") <> Неопределено Тогда
		Запрос.УстановитьПараметр("ПериодОкончание", ПериодОкончание);
	КонецЕсли;
	Если ПараметрыЗапроса.Найти("МассивОбъектов") <> Неопределено Тогда
		Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Зарегистрировать Тогда
			CRM_КлиентыСервер.ЗарегистрироватьОбъектВОбщемЖурнале(Выборка.Ссылка.ПолучитьОбъект(), Ложь);
		Иначе
			НаборЗаписей = РегистрыСведений.CRM_ЖурналДокументов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецЕсли
